GetValidTypes Method
 Obtains a set of types that are valid for this element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public ICollection<ElementId> GetValidTypes()
  Visual Basic
Public Function GetValidTypes As ICollection(Of ElementId)
  Visual C++
public:
ICollection<ElementId^>^ GetValidTypes()
 Return Value
 A set of element IDs of types that are valid for this element or an empty set if element cannot have type assigned.
 See Also
  Element Class
  GetValidTypes Overload
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →